# AbstractSyntax.org -----------------------------------------------------------

# Copyright (C) 2011, 2012 Guillem Marpons <gmarpons@babel.ls.fi.upm.es>
#
# This file is part of Crisp.
#
# Crisp is free software: you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
#
# Crisp is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with Crisp.  If not, see <http://www.gnu.org/licenses/>.

#+PROPERTY: tangle yes
#+PROPERTY: exports code

This is an Org-mode file with Haskell code blocks that can be tangled
(in a literate programming sense) within Emacs with C-c C-v t.

Code blocks in [[*Tests][Tests]] can be loaded and executed in a GHCi session
with C-C C-c.

* Tests

Load Haskell module, first time.

#+begin_src haskell :var pwd=(pwd) :tangle no :results output
  let cd_pwd = return $ ":cd " ++ drop 10 pwd :: IO String
  :cmd cd_pwd
  :cd ..
  :l Crisp.AbstractSyntax
#+end_src

#+RESULTS:
: Loading package ghc-prim ... linking ... done.
: Loading package integer-gmp ... linking ... done.
: Loading package base ... linking ... done.

Evaluate Haskell terms.

#+begin_src haskell :tangle no :results output
  :l Crisp.AbstractSyntax
  :t PredHas "functionCall" ("Func" `Is` (S "FunctionDecl")) ("Call" `Is` (S "CallExpr")) ("Func" `Has` "body" $ "Body")
  :t Not $ "Caller" `Is` C (A "virtual")
  let a = "Caller" `Is` (S "CXXMethodDecl")
  let b = ("Caller" `Has` "functionCall" $ "CallPoint") `And` ("CallPoint" `Has` "directCallee" $ "Callee")
  exprToProlog $ Not $ "Caller" `Is` (A "virtual")
  exprToProlog $ "Body" `HasT` "child" $ "Call"
  let p1 = PredHas "functionCall" ("Func" `Is` S "FunctionDecl") ("Call" `Is` S "CallExpr") (("Func" `Has` "body" $ "Body") `And` ("Body" `HasT` "child" $ "Call"))
  let p2 = PredHas "callee" ("Caller" `Is` S "FunctionDecl") ("Callee" `Is` S "FunctionDecl") (("Caller" `Has` "functionCall" $ "CallPoint") `And` ("CallPoint" `Has` "directCallee" $ "Callee"))
  let r1 = Rule "HICPP" "3.3.13" [MkExprSMBox $ "Caller" `Is` S "FunctionDecl", MkExprSMBox $ "Caller" `Is` S "FunctionDecl"] (("Record" `Is` S "CXXRecordDecl") `And` (("Record" `Has` "ctor" $ "Caller") `Or`("Record" `Has` "destructor" $ "Caller")) `And` ("Record" `Has` "method" $ "Callee") `And` ("Callee" `Is` A "virtual"))
  -- Lloyd-topor
  putStrLn ""
  do { ep <- P.emptyEP; ep <- P.addEPCs (map topLevelToProlog [p1, p2, r1]) ep; return $ P.transLloydTopor ep }
  putStrLn "END"
#+end_src

#+RESULTS:
#+begin_example
[1 of 2] Compiling Crisp.PrologSyntax ( Crisp/PrologSyntax.hs, interpreted )
[2 of 2] Compiling Crisp.AbstractSyntax ( Crisp/AbstractSyntax.hs, interpreted )
Ok, modules loaded: Crisp.AbstractSyntax, Crisp.PrologSyntax.
PredHas "functionCall" ("Func" `Is` (S "FunctionDecl")) ("Call" `Is` (S "CallExpr")) ("Func" `Has` "body" $ "Body")
  :: TopLevel
Not $ "Caller" `Is` C (A "virtual") :: Expr NoSort
Not (At 'is_'(Caller, 'virtual'))
At 'call'('trans_closure', 'child', Body, Call)
*Crisp.AbstractSyntax> *Crisp.AbstractSyntax> *Crisp.AbstractSyntax> *Crisp.AbstractSyntax>
'violation'('HICPP 3.3.13', Caller, Caller) :-
   'is_'(Caller, 'FunctionDecl'),
   'is_'(Caller, 'FunctionDecl'),
   'is_'(Record, 'CXXRecordDecl'),
   'has_ctor'(Record, Caller),
   'has_method'(Record, Callee),
   'is_'(Callee, 'virtual').

'violation'('HICPP 3.3.13', Caller, Caller) :-
   'is_'(Caller, 'FunctionDecl'),
   'is_'(Caller, 'FunctionDecl'),
   'is_'(Record, 'CXXRecordDecl'),
   'has_destructor'(Record, Caller),
   'has_method'(Record, Callee),
   'is_'(Callee, 'virtual').

'has_callee'(Caller, Callee) :-
   'is_'(Caller, 'FunctionDecl'),
   'is_'(Callee, 'FunctionDecl'),
   'has_functionCall'(Caller, CallPoint),
   'has_directCallee'(CallPoint, Callee).

'has_functionCall'(Func, Call) :-
   'is_'(Func, 'FunctionDecl'),
   'is_'(Call, 'CallExpr'),
   'has_body'(Func, Body),
   'call'('trans_closure', 'child', Body, Call).
#+end_example

